#### [infrastructure/][prod] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ui.azurerm_app_service.this will be created
  + resource "azurerm_app_service" "this" {
      + app_service_plan_id               = "/subscriptions/ca70c44c-ad7a-4333-a22c-07ebc6a69224/resourceGroups/time-tracker-service-prod/providers/Microsoft.Web/serverfarms/time-tracker-service-prod"
      + app_settings                      = {
          + "DOCKER_REGISTRY_SERVER_PASSWORD" = (sensitive)
          + "DOCKER_REGISTRY_SERVER_URL"      = (sensitive)
          + "DOCKER_REGISTRY_SERVER_USERNAME" = (sensitive)
        }
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westus"
      + name                              = "time-tracker-service-prod-ui"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "time-tracker-service-prod"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = false
          + always_on                            = false
          + dotnet_framework_version             = "v4.0"
          + ftps_state                           = (known after apply)
          + http2_enabled                        = false
          + ip_restriction                       = (known after apply)
          + linux_fx_version                     = (sensitive)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + remote_debugging_enabled             = false
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = false
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.ui.azurerm_app_service_certificate_binding.this will be created
  + resource "azurerm_app_service_certificate_binding" "this" {
      + app_service_name    = (known after apply)
      + certificate_id      = (known after apply)
      + hostname            = (known after apply)
      + hostname_binding_id = (known after apply)
      + id                  = (known after apply)
      + ssl_state           = "SniEnabled"
      + thumbprint          = (known after apply)
    }

  # module.ui.azurerm_app_service_custom_hostname_binding.this will be created
  + resource "azurerm_app_service_custom_hostname_binding" "this" {
      + app_service_name    = "time-tracker-service-prod-ui"
      + hostname            = "ui.timetrackerapp.ioet.com"
      + id                  = (known after apply)
      + resource_group_name = "time-tracker-service-prod"
      + ssl_state           = (known after apply)
      + thumbprint          = (known after apply)
      + virtual_ip          = (known after apply)
    }

  # module.ui.azurerm_app_service_managed_certificate.this will be created
  + resource "azurerm_app_service_managed_certificate" "this" {
      + canonical_name             = (known after apply)
      + custom_hostname_binding_id = (known after apply)
      + expiration_date            = (known after apply)
      + friendly_name              = (known after apply)
      + host_names                 = (known after apply)
      + id                         = (known after apply)
      + issue_date                 = (known after apply)
      + issuer                     = (known after apply)
      + subject_name               = (known after apply)
      + thumbprint                 = (known after apply)
    }

  # module.ui.azurerm_dns_cname_record.this will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ui"
      + record              = (known after apply)
      + resource_group_name = "time-tracker-service-prod"
      + ttl                 = 300
      + zone_name           = "timetrackerapp.ioet.com"
    }

  # module.ui.azurerm_dns_txt_record.this will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "asuid.ui.timetrackerapp.ioet.com"
      + resource_group_name = "time-tracker-service-prod"
      + ttl                 = 300
      + zone_name           = "timetrackerapp.ioet.com"

      + record {
          + value = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @rodolfoIOET, Action: `pull_request`*